tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "ubuntu/microk8s"
tap "weaveworks/tap"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Modern replacement for 'ls'
brew "exa"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Library and utilities for processing GIFs
brew "giflib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Image manipulation library
brew "jpeg", link: true
# Network authentication protocol
brew "krb5"
# DNS library written in C
brew "ldns"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# General purpose TCP-IP emulator
brew "libslirp"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@16"
# Platform built on V8 to build network applications
brew "node@18"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Object-relational database system
brew "postgresql@14"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Emulator for x86 and PowerPC
brew "qemu"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Generic Python virtualenv management and test command-line tool
brew "tox", link: false
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Terraform
brew "hashicorp/tap/terraform"
# Small, fast, single-package Kubernetes for developers, IoT and edge
brew "ubuntu/microk8s/microk8s"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# App to write, plan, collaborate, and get organized
cask "notion"
# Team communication and collaboration software
cask "slack"
# Development environment
cask "vagrant"
